#!/bin/bash

# сделать исполняемым
#chmod +x check_sys.sh

echo "
Проверка файловой системы с:
* RAID, 
* LVM томами и
* определения физических дисков 
следующие команды:
"

echo "================================================================"
echo "\$cat /proc/mdstat -> Проверка RAID:"
cat /proc/mdstat

echo "================================================================"
echo "\$sudo mdadm --detail /dev/mdX -> Подробно о RAID:"
sudo mdadm --detail /dev/md126

echo "----------------------------------------------------------------"
sudo mdadm --detail /dev/md127

echo "================================================================"
echo "\$sudo pvs -> Проверка LVM Показывает физические тома:"
sudo pvs

echo "================================================================"
echo "\$sudo vgs -> Проверка LVM Показывает группы томов:"
sudo vgs

echo "================================================================"
echo "\$sudo lvs -> Проверка LVM Показывает логические тома:"
sudo lvs

echo "================================================================"
echo "\$sudo df -h -> Показывает использование дискового пространства:"
sudo df -h 

echo "================================================================"
echo "\$sudo lsblk  -> Показывает структуру блочных устройств"
sudo lsblk 

echo "================================================================"
echo "\$sudo fdisk -l -> Определение физических дисков:"
sudo fdisk -l

echo "================================================================"
echo "\$sudo ls -l /dev/disk/by-id/ -> Определение физических дисков:"
sudo ls -l /dev/disk/by-id/

echo "================================================================"
echo "\$sudo fsck /dev/mapper/vg-lv -> Проверка целостности файловой системы:"
sudo fsck /dev/mapper/vg-lv